# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   - **Only one challenge is mandatory, you can pick your favorite**
   - **Please always use relative paths to access the data**
  
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
%matplotlib inline

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset.
Download the dataset from the `data` folder

#### First import the dataset into a dataframe called `temp`.

In [7]:
# your code here
temp = pd.read_csv('../data/Temp_States.csv')

#### Print `temp`.

In [27]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [10]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
your comments here
"""
# Two objects (strings) and one float (temp)

#### Select the rows where state is New York.

In [18]:
# your code here
NYC = temp[temp['State']== 'New York']
NYC.head()

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [20]:
# your code here
NYC["Temperature"].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [26]:
# your code here
warm = temp[temp["Temperature"] > 15]
warm

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [34]:
# your code here
warm_city = warm["City"]
warm_city

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [39]:
# your code here
#condition: temp > 15 & temp <20

mild = temp[(temp["Temperature"] > 15) & (temp["Temperature"] <20)]
mild

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [41]:
# your code here
temp.groupby(temp["State"]).mean()

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [67]:
#or by hand: 
som["som_temp"] = temp.groupby(temp["State"]).sum()
som["len"] = temp["City"].groupby(temp["State"]).count()

som["avg"] = som["som_temp"] / som["len"]
som["avg"]

             Temperature   som_temp  len        avg
State
Connecticut    31.666667  31.666667    2  15.833333
New Jersey     42.222222  42.222222    2  21.111111
New York       32.222222  32.222222    3  10.740741

In [45]:
temp.groupby(temp["State"]).std()

             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

In [116]:
# or by hand: std = sqrt (SUM (x[i]-mu)**2 / n(-1))

#add the som-table to the temp table, so you can use the average
merge_temp = pd.merge(temp, som, left_on = "State", right_on = "State", how = "outer")
merge_temp = merge_temp.drop(["Temperature_y", "len"], axis = 1)

#calculate (x-mu)**2 for each row
merge_temp["from_mu_2"] = (merge_temp["Temperature_x"]-merge_temp["avg"])**2
merge_temp["count_n"] = 1
print(merge_temp)

#group by state
calc_stdev = merge_temp.groupby("State").sum()

calc_stdev["stdev"] = np.sqrt(calc_stdev["from_mu_2"]/(calc_stdev["count_n"]-1))
calc_stdev["stdev"]

         City        State  Temperature_x   som_temp        avg  from_mu_2  \
0         NYC     New York      19.444444  32.222222  10.740741  75.754458
1      Albany     New York       9.444444  32.222222  10.740741   1.680384
2     Buffalo     New York       3.333333  32.222222  10.740741  54.869684
3    Hartford  Connecticut      17.222222  31.666667  15.833333   1.929012
4  Bridgeport  Connecticut      14.444444  31.666667  15.833333   1.929012
5      Treton   New Jersey      22.222222  42.222222  21.111111   1.234568
6      Newark   New Jersey      20.000000  42.222222  21.111111   1.234568

   count_n
0        1
1        1
2        1
3        1
4        1
5        1
6        1

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: stdev, dtype: float64

# [ONLY ONE MANDATORY]  Challenge 2

Download the dataset `employees` from the `data` folder.
Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [ ]:
# your code here

#### Explore the data types of the `employees` dataframe. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [ ]:
# your code here

#### What's the highest salary?

In [ ]:
# your code here

#### What's the lowest salary?

In [ ]:
# your code here

#### Who are the employees with the lowest salary?

In [ ]:
# your code here

#### Find all the information about an employee called David.

In [ ]:
# your code here

#### Could you return only David's salary?

In [ ]:
# your code here

#### Print all the rows where job title is associate.

In [ ]:
# your code here

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [ ]:
# Method 1
# your code here

In [ ]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [ ]:
# your code here

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [ ]:
# your code here

####  What is the average salary per title?

In [ ]:
# your code here

####  Find the salary quartiles.

In [ ]:
# your code here

#### Is the mean salary different per gender?

In [ ]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [ ]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
Download the dataset `Orders` from the `data` folder.
Load the `Orders` into a dataframe. Call the dataframe `Orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here